Examinator/src/Catalogs/КартыСУЗ/КартыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КартыСУЗ</name>
  <predefined>
    <items>
      <name>АвтоКарта</name>
      <description>Авто карта</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьРесурсСОднимФайлом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/СодержаниеСУЗ/СодержаниеСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СодержаниеСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СводыЗнанийСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЭлемент</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <comment>Item / parameters</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>limitConditions / attemptLimit</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПопытки</name>
    <comment>limitConditions / attemptAbsoluteDurationLimit (Тип: duration SCORM)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогВыполнения</name>
    <comment>completionThreshold</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИнициализации</name>
    <comment>dataFromLMS</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПослеИстеченияВремени</name>
    <comment>timeLimitAction</comment>
    <type>
      <types>EnumRef.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьСсылкиНаТерминыГлоссария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменятьПользовательскиеНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактироватьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ПодборкиСУЗ/ПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрезентация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбиратьЭлементыИзРубрикатора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификационнаяГруппировка</name>
    <type>
      <types>CatalogRef.КлассификационныеГруппировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьГруппыЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКлассификатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтартовуюСтраницу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЭлементов</name>
    <type>
      <types>EnumRef.ВариантыПредставленияЭлементовПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СвернутьРазделы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНавигации</name>
    <type>
      <types>EnumRef.ТипыНавигацииПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГруппЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйРесурс</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыравниваниеСтартовогоРесурса</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСложностиПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСложностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТаймер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматТаймера</name>
    <type>
      <types>EnumRef.ФорматыТаймераСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйРесурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НумероватьСтраницы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредыдущиеПопытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьОткрытыеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтоимостьВопроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьКомментарииВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияНаФинальнойСтранице</name>
    <type>
      <types>EnumRef.ИнформацияНаФинальнойСтраницеТестаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Презентация</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/КартыСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ТипОбъектаСУЗ() Экспорт
	
	Возврат Перечисления.ТипыОбъектовСУЗ.map;
	
КонецФункции

// Позволяет получить XML данные объекта.
//
// Параметры
//  ОбъектСУЗ          - экземпляр обработки ОбъектСУЗ.
//  ПараметрыСсылки    – Структура, содержит параметры ссылки по которой вызывается вопрос.
//  КонтекстВыполнения - Структура, содержит параметры контекста выполнения объекта.
//
// Возвращаемое значение:
//   Строка – содержит XML представление объекта СУЗ.
//
Функция ПолучитьXMLПредставление(Карта, ПараметрыСсылки, КонтекстВыполнения) Экспорт
	
	КартаXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Map", "Карта"); 
	КартаXDTO     = ФабрикаXDTO.Создать(КартаXDTOТип);
	
    КартаXDTO.id  = Карта.УникальныйИдентификатор();
	
	
	// Получаем параметры карты.
	
	ИмяОбъектаСУЗ    = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипОбъектаСУЗ());
	КартаXDTO.object = ИмяОбъектаСУЗ;
	
	// Возможные значения:
	// normal  - обычное представление для клиента.
	// print   - версия для печати.
	// dynamic - интерактивное сворачивающееся дерево (используется в веб-клиенте в левом дереве).
	
	СпособОтображения = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "view");
	Если НЕ ЗначениеЗаполнено(СпособОтображения) Тогда
		СпособОтображения = "normal";
	КонецЕсли;
	
	КартаXDTO.СпособОтображения = СпособОтображения;	
	КартаXDTO.РежимЭкспорта     = ?(КонтекстВыполнения.ПараметрыЭкспорта = Неопределено, Ложь, Истина);
	
	// Получаем предмет карты
	
	ПредметКарты = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "targetMap");
	ИдентификаторПредметаКарты = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "idTargetMap");
	
	УникальныйИдентификаторПредметаКарты = Новый УникальныйИдентификатор(ИдентификаторПредметаКарты);
	
	Если ПредметКарты = "KnowledgeBase" Тогда
		ПредметКартыСсылка = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(УникальныйИдентификаторПредметаКарты);
		ИмяОбъектаСУЗПредметаКарты = "knowledgeBase";
	КонецЕсли;
	
	Если ПредметКарты = "Folder" Тогда
		ПредметКартыСсылка = Справочники.СодержаниеСУЗ.ПолучитьСсылку(УникальныйИдентификаторПредметаКарты);
		ИмяОбъектаСУЗПредметаКарты = "";
	КонецЕсли;
	
	Если ПредметКарты = "Collection" Тогда
		ПредметКартыСсылка = Справочники.ПодборкиСУЗ.ПолучитьСсылку(УникальныйИдентификаторПредметаКарты);
		ИмяОбъектаСУЗПредметаКарты = "collection";
	КонецЕсли;
	
	// Получаем уровень детализации карты.
	
	УровеньДетализации = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "levelMap");
	
	Если ПустаяСтрока(УровеньДетализации) ИЛИ УровеньДетализации = "NaN" Тогда
		УровеньДетализации = "level1";
	КонецЕсли;
	
	Если УровеньДетализации = "max" ИЛИ УровеньДетализации = "null" Тогда
		УровеньДетализации = "level2";
	КонецЕсли;
	
	Если ПредметКарты = "Collection" Тогда
		УровеньДетализации = "level1";
	КонецЕсли;
	
	КартаXDTO.УровеньДетализации = УровеньДетализации;
	
	// Формируем элементы карты
	
	ЭлементыКартыXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Map","ЭлементыКарты"); 
    ЭлементыКартыXDTO = ФабрикаXDTO.Создать(ЭлементыКартыXDTOТип);
	
	СформироватьXDTOЭлементовКарты(ПредметКартыСсылка, ЭлементыКартыXDTO, ПредметКарты, УровеньДетализации, Карта.СкрыватьРесурсСОднимФайлом);	
	
	КартаXDTO.ЭлементыКарты = ЭлементыКартыXDTO;
	
	// Предмет карты
	
	ПредметКартыXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Map","ПредметКарты"); 
	ПредметКартыXDTO     = ФабрикаXDTO.Создать(ПредметКартыXDTOТип);
	
	ПредметКартыXDTO.Наименование = ПредметКартыСсылка.Наименование;
	ПредметКартыXDTO.id = УникальныйИдентификаторПредметаКарты;
	ПредметКартыXDTO.targetMap = ПредметКарты;
	
	Если ЗначениеЗаполнено(ИмяОбъектаСУЗПредметаКарты) Тогда
		ПредметКартыXDTO.object = ИмяОбъектаСУЗПредметаКарты;
	КонецЕсли;
	
	КартаXDTO.ПредметКарты = ПредметКартыXDTO;
	
	// Формируем XML
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, КартаXDTO);
	XMLДанные = ЗаписьXML.Закрыть();
	
	ШаблонОбъекта = ОбъектыСУЗ.ПолучитьСсылкуНаXSLШаблонОбъекта(Карта);
	ОбъектыСУЗ.ДобавитьШаблонВСписокОбъекта(ШаблонОбъекта, КонтекстВыполнения.СписокШаблонов);
	
	Возврат XMLДанные;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПолучитьСсылкуНаПредметКарты(ПредметКарты, УникальныйИдентификаторПредметаКарты) Экспорт
	
	Если ПредметКарты = "Folder" Тогда
		ПредметКартыСсылка = Справочники.СодержаниеСУЗ.ПолучитьСсылку(УникальныйИдентификаторПредметаКарты);
	КонецЕсли;
	
	Если ПредметКарты = "KnowledgeBase" Тогда
		ПредметКартыСсылка = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(УникальныйИдентификаторПредметаКарты);
	КонецЕсли;
	
	Если ПредметКарты = "Collection" Тогда
		ПредметКартыСсылка = Справочники.ПодборкиСУЗ.ПолучитьСсылку(УникальныйИдентификаторПредметаКарты);
	КонецЕсли;
	
	Возврат ПредметКартыСсылка;
	
КонецФункции

Функция СформироватьXDTOЭлементаКарты(Строка, КонтейнерЭлементовXDTO, ВключатьПодчиненныеСтроки=Ложь)
	
	ЭлементКартыXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Map","ЭлементКарты");
	ЭлементКартыXDTO    = ФабрикаXDTO.Создать(ЭлементКартыXDTOТип);
	
	// Идентификатор самого элемента карты, например
	// Элемента справочника СодержаниеСУЗ.
	ЭлементКартыXDTO.id               = Строка.Ссылка.УникальныйИдентификатор();
	ЭлементКартыXDTO.ИмяЭлементаКарты = Строка.Ссылка.Метаданные().Имя;
	
	ЭлементКартыXDTO.Наименование     = Строка.Наименование;
	ЭлементКартыXDTO.Код              = Строка.Код;
	ЭлементКартыXDTO.ЭтоГруппа        = Строка.ЭтоГруппа;
	ЭлементКартыXDTO.ПометкаУдаления  = Строка.ПометкаУдаления;
	
	Если Строка.Скрывать = Null Тогда
		ЭлементКартыXDTO.Скрывать = Ложь;
	Иначе
		ЭлементКартыXDTO.Скрывать = Строка.Скрывать;
	КонецЕсли;
	
	ОбъектСУЗXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/KnowledgeSources","ОбъектСУЗ");
	
	Если ЗначениеЗаполнено(Строка.СсылкаНаОбъектСУЗ) Тогда
		ОбъектСУЗXDTO              = ФабрикаXDTO.Создать(ОбъектСУЗXDTOТип);
		ОбъектСУЗXDTO.id           = Строка.СсылкаНаОбъектСУЗ.УникальныйИдентификатор();
		ОбъектСУЗXDTO.object       = Строка.ТипОбъектаСУЗ;
		ЭлементКартыXDTO.ОбъектСУЗ = ОбъектСУЗXDTO;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Строка.СсылкаНаВладельца) И ЗначениеЗаполнено(Строка.ТипОбъектаСУЗВладельца) Тогда
		ВладелецXDTO              = ФабрикаXDTO.Создать(ОбъектСУЗXDTOТип);
		ВладелецXDTO.id           = Строка.СсылкаНаВладельца.УникальныйИдентификатор();
		ВладелецXDTO.object       = Строка.ТипОбъектаСУЗВладельца;
		ЭлементКартыXDTO.Владелец = ВладелецXDTO;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Строка.Карта) Тогда
		
		КартаXDTO              = ФабрикаXDTO.Создать(ОбъектСУЗXDTOТип);
		КартаXDTO.id           = Строка.Карта.УникальныйИдентификатор();
		
		ЭлементКартыXDTO.Карта = КартаXDTO;
		
		ПредметКартыXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Map","ПредметКарты"); 
		ПредметКартыXDTO    = ФабрикаXDTO.Создать(ПредметКартыXDTOТип);
		
		ПредметКартыXDTO.id        = Строка.Ссылка.УникальныйИдентификатор();
		
		Если ТипЗнч(Строка.Ссылка) = Тип("СправочникСсылка.СодержаниеСУЗ") Тогда
			ПредметКартыXDTO.targetMap = "Folder";
		Иначе
			ПредметКартыXDTO.targetMap = "Collection";
		КонецЕсли;
		
		ЭлементКартыXDTO.ПредметКарты = ПредметКартыXDTO;
		
	КонецЕсли;

	Если ВключатьПодчиненныеСтроки Тогда
		Для каждого ПодчиненнаяСтрока Из Строка.Строки Цикл
			СформироватьXDTOЭлементаКарты(ПодчиненнаяСтрока, ЭлементКартыXDTO, ВключатьПодчиненныеСтроки);
		КонецЦикла;
	КонецЕсли;
	
	КонтейнерЭлементовXDTO.ЭлементКарты.Добавить(ЭлементКартыXDTO);
	
	Возврат ЭлементКартыXDTO;
	
КонецФункции

Процедура СкопироватьВеткуДерева(СтрокаПриемник, КоллекцияКопируемыхСтрок, Колонки)
	
	Для каждого Строка Из КоллекцияКопируемыхСтрок Цикл
		НоваяСтрока = СтрокаПриемник.Строки.Добавить();
		Для каждого Колонка Из Колонки Цикл
			НоваяСтрока[Колонка] = Строка[Колонка];
		КонецЦикла;
		СкопироватьВеткуДерева(НоваяСтрока, Строка.Строки, Колонки);
	КонецЦикла;
	
КонецПроцедуры

Процедура СвернутьДеревоКарты(МассивКолонок, КоллекцияСтрокДерева, КонтейнерЭлементовXDTO, ПредметКарты, УровеньДетализации, СкрыватьРесурсСОднимФайлом, Знач ОбрабатываемаяПодборка=Неопределено, Знач ОбрабатываемыйРесурс=Неопределено)
	
	// Примечание: Следует обратить внимание, что параметр ОбрабатываемаяПодборка
	// Передается по значению, чтобы при выходе из Рекурсивно вызванной процедуры он не изменялся для 
	// Текущего цикла.
	
	Сч = КоллекцияСтрокДерева.Количество();
	
	Если Сч > 0 Тогда
		Уровень = КоллекцияСтрокДерева.Получить(0).Уровень(); // Текущий уровень дерева для всех элементов данного цикла.
	Иначе
		Возврат;
	КонецЕсли;
	
	МассивСтрокЭлементовПодборки = Новый Массив();
	МассивСтрокЭлементовРесурса  = Новый Массив();
	
	// ОбрабатываемыйРесурс = Неопределено; // Ресурс не имеет вложенных элементов, поэтому для каждой коллекции строк его обнуляем.
	
	// Примечание: Если Сч = 0, то значит дошли до конца и в
	// Нулевой итерации цикла выполняем действия над последними
	// Элементами, которые были обработаны (например формируем структуру подборки).
	Пока Сч >= 0 Цикл
		
		Если Сч > 0 Тогда
		
			Строка = КоллекцияСтрокДерева.Получить(Сч - 1);
			
			// Устанавливаем для каждой строки необходимые для XDTO данные.
			
			Если ПредметКарты = "KnowledgeBase" ИЛИ ПредметКарты = "Folder" Тогда 
			
				Строка.Наименование           = Строка.НаименованиеЭлементаСводаЗнаний;
				Строка.Код                    = Строка.КодЭлементаСводаЗнаний;
				Строка.ЭтоГруппа              = Строка.ЭтоГруппаСводаЗнаний;
				Строка.ТипОбъектаСУЗ          = ОбъектыСУЗ.ПолучитьТипОбъектаСУЗ(Строка.ОбъектСУЗЭлементаСводаЗнаний);
				Строка.СсылкаНаОбъектСУЗ      = Строка.ОбъектСУЗЭлементаСводаЗнаний;
				Строка.СсылкаНаВладельца      = Строка.СводЗнаний;
				Строка.ТипОбъектаСУЗВладельца = Перечисления.ТипыОбъектовСУЗ.knowledgeBase;
				Строка.Карта                  = Строка.КартаЭлементаСводаЗнаний;
				Строка.Ссылка                 = Строка.ЭлементСводаЗнаний;
				Строка.ПометкаУдаления        = Строка.ПометкаУдаленияЭлементаСводаЗнаний;
				Строка.Скрывать               = Ложь;
				
			КонецЕсли;
			
			Если (ПредметКарты = "Collection" ИЛИ УровеньДетализации = "level2") 
				И ЗначениеЗаполнено(Строка.ЭлементыПодборки) Тогда
				
				Строка.Наименование           = Строка.НаименованиеЭлементаПодборки;
				Строка.Код                    = Строка.КодЭлементаПодборки;
				Строка.ЭтоГруппа              = Строка.ЭтоГруппаПодборки;
				Строка.ТипОбъектаСУЗ          = ОбъектыСУЗ.ПолучитьТипОбъектаСУЗ(Строка.ОбъектСУЗЭлементаПодборки);
				Строка.СсылкаНаОбъектСУЗ      = Строка.ОбъектСУЗЭлементаПодборки;
				Строка.СсылкаНаВладельца      = Строка.Подборка;
				Строка.ТипОбъектаСУЗВладельца = Перечисления.ТипыОбъектовСУЗ.collection;
				Строка.Карта                  = Справочники.КартыСУЗ.ПустаяСсылка();
				Строка.Ссылка                 = Строка.ЭлементыПодборки;
				Строка.ПометкаУдаления        = Строка.ПометкаУдаленияЭлементаПодборки;
				Строка.Скрывать               = Ложь;
				
			КонецЕсли;
			
			Если (ПредметКарты = "KnowledgeBase" ИЛИ ПредметКарты = "Folder") И УровеньДетализации = "level2" 
				И ЗначениеЗаполнено(Строка.ФайлСводаЗнаний) Тогда
				
				Строка.Наименование           = Строка.НаименованиеФайлаСводаЗнаний;
				Строка.Код                    = 0;
				Строка.ЭтоГруппа              = Строка.ЭтоГруппаФайловСводаЗнаний;
				Строка.ТипОбъектаСУЗ          = Перечисления.ТипыОбъектовСУЗ.file;
				Строка.СсылкаНаОбъектСУЗ      = Строка.ФайлСводаЗнаний;
				Строка.СсылкаНаВладельца      = Строка.РесурсСводаЗнаний;
				Строка.ТипОбъектаСУЗВладельца = Перечисления.ТипыОбъектовСУЗ.res;
				Строка.Карта                  = Справочники.КартыСУЗ.ПустаяСсылка();
				Строка.Ссылка                 = Строка.ФайлСводаЗнаний;
				Строка.ПометкаУдаления        = Строка.ПометкаУдаленияФайлаСводаЗнаний;
				Строка.Скрывать               = Строка.СкрыватьФайлСводаЗнаний;
				
			КонецЕсли;
			
			Если (ПредметКарты = "Collection" ИЛИ УровеньДетализации = "level2")
				И ЗначениеЗаполнено(Строка.ФайлПодборок) Тогда
				
				Строка.Наименование           = Строка.НаименованиеФайлаПодборок;
				Строка.Код                    = 0;
				Строка.ЭтоГруппа              = Строка.ЭтоГруппаФайловПодборок;
				Строка.ТипОбъектаСУЗ          = Перечисления.ТипыОбъектовСУЗ.file;
				Строка.СсылкаНаОбъектСУЗ      = Строка.ФайлПодборок;
				Строка.СсылкаНаВладельца      = Строка.РесурсыПодборок;
				Строка.ТипОбъектаСУЗВладельца = Перечисления.ТипыОбъектовСУЗ.res;
				Строка.Карта                  = Справочники.КартыСУЗ.ПустаяСсылка();
				Строка.Ссылка                 = Строка.ФайлПодборок;
				Строка.ПометкаУдаления        = Строка.ПометкаУдаленияФайлаПодборки;
				Строка.Скрывать               = Строка.СкрыватьФайлПодборки;
				
			КонецЕсли;
			
			// Следим, когда начнется обработка новой подборки или ресурса и устанавливаем для них необходимые реквизиты.
			
			Если УровеньДетализации = "level2" Тогда
			
				// Начали обрабатывать подборку
				Если ЗначениеЗаполнено(Строка.Подборка)
					И НЕ ЗначениеЗаполнено(ОбрабатываемаяПодборка) Тогда
					ОбрабатываемаяПодборка = Новый Структура();
					
					ОбрабатываемаяПодборка.Вставить("Наименование", Строка.НаименованиеПодборки);
					ОбрабатываемаяПодборка.Вставить("Код", Строка.КодЭлементаСводаЗнаний);
					ОбрабатываемаяПодборка.Вставить("ЭтоГруппа", Ложь);
					ОбрабатываемаяПодборка.Вставить("ТипОбъектаСУЗ", Перечисления.ТипыОбъектовСУЗ.collection);
					ОбрабатываемаяПодборка.Вставить("СсылкаНаОбъектСУЗ", Строка.Подборка);
					ОбрабатываемаяПодборка.Вставить("СсылкаНаВладельца", Строка.ЭлементСводаЗнаний); // Владельцем подборки выступает элемент свода знаний, которому она принадлежит.
					ОбрабатываемаяПодборка.Вставить("ТипОбъектаСУЗВладельца", Неопределено);
	                ОбрабатываемаяПодборка.Вставить("Карта", Строка.КартаПодборки);
					ОбрабатываемаяПодборка.Вставить("Ссылка",Строка.ЭлементСводаЗнаний);
					ОбрабатываемаяПодборка.Вставить("ПометкаУдаления", Строка.ПометкаУдаленияЭлементаСводаЗнаний);
					ОбрабатываемаяПодборка.Вставить("Скрывать", Ложь);
					
					ОбрабатываемаяПодборка.Вставить("ЭтоТест",Строка.ЭтоТест);
					ОбрабатываемаяПодборка.Вставить("Уровень", Уровень);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если (ПредметКарты = "KnowledgeBase" ИЛИ ПредметКарты = "Folder") И УровеньДетализации = "level2" Тогда
			
				// Начали обрабатывать ресурс свода знаний
				Если ЗначениеЗаполнено(Строка.РесурсСводаЗнаний) 
					И НЕ ЗначениеЗаполнено(ОбрабатываемыйРесурс) Тогда
					ОбрабатываемыйРесурс = Новый Структура();
					ОбрабатываемыйРесурс.Вставить("Наименование", Строка.НаименованиеЭлементаСводаЗнаний);
					ОбрабатываемыйРесурс.Вставить("Код", Строка.КодЭлементаСводаЗнаний);
					ОбрабатываемыйРесурс.Вставить("Уровень", Уровень);
					ОбрабатываемыйРесурс.Вставить("ЭтоГруппа", Ложь);
					ОбрабатываемыйРесурс.Вставить("ТипОбъектаСУЗ", Перечисления.ТипыОбъектовСУЗ.res);
					ОбрабатываемыйРесурс.Вставить("СсылкаНаОбъектСУЗ", Строка.РесурсСводаЗнаний);
					ОбрабатываемыйРесурс.Вставить("СсылкаНаВладельца", Строка.ЭлементСводаЗнаний);
					ОбрабатываемыйРесурс.Вставить("ТипОбъектаСУЗВладельца", Неопределено);
					ОбрабатываемыйРесурс.Вставить("Карта", Справочники.КартыСУЗ.ПустаяСсылка());
					ОбрабатываемыйРесурс.Вставить("Ссылка",Строка.ЭлементСводаЗнаний);
					ОбрабатываемыйРесурс.Вставить("ПометкаУдаления",Строка.ПометкаУдаленияЭлементаСводаЗнаний);
					ОбрабатываемыйРесурс.Вставить("ФайлЗапуска",Строка.ФайлЗапускаРесурсаСводаЗнаний);
					ОбрабатываемыйРесурс.Вставить("Скрывать", Ложь);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ПредметКарты = "Collection" ИЛИ УровеньДетализации = "level2" Тогда
			
				// Начали обрабатывать ресурс подборки
				Если ЗначениеЗаполнено(Строка.РесурсыПодборок) 
					И НЕ ЗначениеЗаполнено(ОбрабатываемыйРесурс) Тогда
					ОбрабатываемыйРесурс = Новый Структура();
					ОбрабатываемыйРесурс.Вставить("Наименование", Строка.НаименованиеЭлементаПодборки);
					ОбрабатываемыйРесурс.Вставить("Код", Строка.КодЭлементаПодборки);
					ОбрабатываемыйРесурс.Вставить("Уровень", Уровень);
					ОбрабатываемыйРесурс.Вставить("ЭтоГруппа", Ложь);
					ОбрабатываемыйРесурс.Вставить("ТипОбъектаСУЗ", Перечисления.ТипыОбъектовСУЗ.res);
					ОбрабатываемыйРесурс.Вставить("СсылкаНаОбъектСУЗ", Строка.РесурсыПодборок);
					ОбрабатываемыйРесурс.Вставить("СсылкаНаВладельца", Строка.ЭлементыПодборки);
					ОбрабатываемыйРесурс.Вставить("ТипОбъектаСУЗВладельца", Неопределено);
					ОбрабатываемыйРесурс.Вставить("Карта", Справочники.КартыСУЗ.ПустаяСсылка());
					ОбрабатываемыйРесурс.Вставить("Ссылка",  Строка.ЭлементыПодборки);
					ОбрабатываемыйРесурс.Вставить("ПометкаУдаления", Строка.ПометкаУдаленияЭлементаПодборки);
					ОбрабатываемыйРесурс.Вставить("ФайлЗапуска",Строка.ФайлЗапускаРесурсаПодборок);
					ОбрабатываемыйРесурс.Вставить("Скрывать", Ложь);
					
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
		
		Если УровеньДетализации = "level2" Тогда
		
			// Закончили обрабатывать подборку. То есть началась другая подборка или другой элемент или
			// Закончились строки (проверяем еще, чтобы был тот же уровень, а не больше).
			Если ЗначениеЗаполнено(ОбрабатываемаяПодборка)
				И ((Сч > 0 И ОбрабатываемаяПодборка.СсылкаНаОбъектСУЗ <> Строка.Подборка)
				ИЛИ (Сч = 0 И Уровень = ОбрабатываемаяПодборка.Уровень)
				ИЛИ (Сч > 0 И ОбрабатываемаяПодборка.СсылкаНаВладельца <> Строка.ЭлементСводаЗнаний)) Тогда
				
				// Здесь добавляется новая строка - Подборка, а все запомненные
				// Элементы подборки добавляются к ней как подчиненные, а из дерева
				// Удаляются.
				
				НоваяСтрока = КоллекцияСтрокДерева.Вставить(Сч);
				
				Для каждого Колонка Из МассивКолонок Цикл
					НоваяСтрока[Колонка] = ОбрабатываемаяПодборка[Колонка];
				КонецЦикла;
				
				// Формируем XDTO подборки без подчиненных элементов
				ЭлементКартыXDTO = СформироватьXDTOЭлементаКарты(НоваяСтрока, КонтейнерЭлементовXDTO);
				
				// Формируем XDTO подчиненных строк, если это не тест.
				Если НЕ ОбрабатываемаяПодборка.ЭтоТест Тогда
				
					Для каждого СтрокаЭлементаПодборки Из МассивСтрокЭлементовПодборки Цикл
						СформироватьXDTOЭлементаКарты(СтрокаЭлементаПодборки, ЭлементКартыXDTO, Истина);
					КонецЦикла;
					
				КонецЕсли;
				
				МассивСтрокЭлементовПодборки.Очистить();
				ОбрабатываемаяПодборка = Неопределено;
				
				// Повторно прогоняем данный цикл, так как если перешли, например,
				// На обработку другой подборки, то это не было зафиксировано в
				// Области "Начали обрабатывать подборку".
				Продолжить;
				
			КонецЕсли;

		КонецЕсли;
		
		Если ПредметКарты = "Collection" ИЛИ УровеньДетализации = "level2" Тогда
		
			Если ЗначениеЗаполнено(ОбрабатываемыйРесурс) Тогда
			
				ЗакончилиОбработкуРесурса = Ложь;
				
				Если ПредметКарты = "KnowledgeBase" ИЛИ ПредметКарты = "Folder" Тогда
				
					Если УровеньДетализации = "level2" Тогда
						
						Если ЗначениеЗаполнено(ОбрабатываемыйРесурс) И (
							(Сч > 0 И ОбрабатываемыйРесурс.СсылкаНаОбъектСУЗ <> Строка.РесурсыПодборок	И ОбрабатываемыйРесурс.СсылкаНаОбъектСУЗ <> Строка.РесурсСводаЗнаний)
							ИЛИ (Сч = 0 И Уровень = ОбрабатываемыйРесурс.Уровень)
							ИЛИ (Сч > 0 И ОбрабатываемыйРесурс.СсылкаНаВладельца <> Строка.ЭлементСводаЗнаний И ОбрабатываемыйРесурс.СсылкаНаВладельца <> Строка.ЭлементыПодборки)
							) Тогда
							ЗакончилиОбработкуРесурса = Истина;
						КонецЕсли;
						
					Иначе
						
						Если ЗначениеЗаполнено(ОбрабатываемыйРесурс)
							И ((Сч > 0 И ОбрабатываемыйРесурс.СсылкаНаОбъектСУЗ <> Строка.РесурсСводаЗнаний) ИЛИ (Сч = 0 И Уровень = ОбрабатываемыйРесурс.Уровень) ИЛИ (Сч > 0 И ОбрабатываемыйРесурс.СсылкаНаВладельца <> Строка.ЭлементСводаЗнаний)) Тогда
							ЗакончилиОбработкуРесурса = Истина;
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					
					Если ЗначениеЗаполнено(ОбрабатываемыйРесурс)
						И ((Сч > 0 И ОбрабатываемыйРесурс.СсылкаНаОбъектСУЗ <> Строка.РесурсыПодборок) ИЛИ (Сч = 0 И Уровень = ОбрабатываемыйРесурс.Уровень) ИЛИ (Сч > 0 И ОбрабатываемыйРесурс.СсылкаНаВладельца <> Строка.ЭлементыПодборки)) Тогда
						ЗакончилиОбработкуРесурса = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
				
				// Закончили обрабатывать ресурс. Алгоритм аналогичный подборкам.
				Если ЗакончилиОбработкуРесурса Тогда
					
					НоваяСтрока = КоллекцияСтрокДерева.Вставить(Сч);
					
					Для каждого Колонка Из МассивКолонок Цикл
						НоваяСтрока[Колонка] = ОбрабатываемыйРесурс[Колонка];
					КонецЦикла;
					
					// Проверяем, нужно ли вообще показывать в карте файлы ресурса.
					Если НЕ СкрыватьРесурсСОднимФайлом ИЛИ МассивСтрокЭлементовРесурса.Количество() > 1 Тогда
						ПоказыватьФайлыРесурса = Истина;
					Иначе
						ПоказыватьФайлыРесурса = Ложь;
						НоваяСтрока.Наименование = МассивСтрокЭлементовРесурса[0].Наименование; // Ресурс примет имя единственного файла.
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ОбрабатываемыйРесурс.ФайлЗапуска) Тогда
						ПоказыватьФайлыРесурса = Ложь;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ОбрабатываемаяПодборка) Тогда
						
						// Если обрабатываем ресурс, размещенный в подборке, то
						// Копируем файлы ресурса к новой строке ресурса. В XDTO
						// Они будут добавлены потом при окончании обработки самой подборки.
						
						Если ПоказыватьФайлыРесурса Тогда
							СкопироватьВеткуДерева(НоваяСтрока, МассивСтрокЭлементовРесурса, МассивКолонок);
						КонецЕсли;
						
						Сч2 = МассивСтрокЭлементовРесурса.Количество();
						
						Пока Сч2 > 0 Цикл
							
							СтрокаРесурса = МассивСтрокЭлементовРесурса[Сч2-1];
							КоллекцияСтрокДерева.Удалить(СтрокаРесурса);
							
							Сч2 = Сч2 - 1;
							
						КонецЦикла;
						
						// Ресурс входит в обрабатываемую в данный момент обработку.
						// Добавляем в строки данной подборки.
						
						МассивСтрокЭлементовПодборки.Добавить(НоваяСтрока);
						
					Иначе
						
						// Ресурс не в подборке, а в своде знаний.
						
						ЭлементКартыXDTO = СформироватьXDTOЭлементаКарты(НоваяСтрока, КонтейнерЭлементовXDTO);
						
						Если ПоказыватьФайлыРесурса Тогда
							Для каждого СтрокаРесурса Из МассивСтрокЭлементовРесурса Цикл
								СформироватьXDTOЭлементаКарты(СтрокаРесурса, ЭлементКартыXDTO, Истина);
							КонецЦикла;
						КонецЕсли;
						
					КонецЕсли;
					
					МассивСтрокЭлементовРесурса.Очистить();
					ОбрабатываемыйРесурс = Неопределено;
					
					Продолжить;
					
				КонецЕсли;
				
				
			КонецЕсли;
			
		
		КонецЕсли;
		
		Если Сч > 0 Тогда
			
			// Запоминаем элементы подборки и файлы ресурсов в процессе прохода
			// Для последующей их обработки как подчиненных подборки или ресурсу соответственно. 
			Если ЗначениеЗаполнено(ОбрабатываемаяПодборка)
				И НЕ ЗначениеЗаполнено(ОбрабатываемыйРесурс) Тогда
				МассивСтрокЭлементовПодборки.Добавить(Строка);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОбрабатываемыйРесурс) Тогда
				МассивСтрокЭлементовРесурса.Добавить(Строка);
			КонецЕсли;
			
			Если КонтейнерЭлементовXDTO <> Неопределено
				И НЕ ЗначениеЗаполнено(ОбрабатываемаяПодборка)
				И НЕ ЗначениеЗаполнено(ОбрабатываемыйРесурс) Тогда // Обычный элемент карты
				
				ЭлементКартыXDTO = СформироватьXDTOЭлементаКарты(Строка, КонтейнерЭлементовXDTO);
				
			Иначе // Файл или элемент подборки. Будут добавлены после окончания обработки ресурса и подборки соответственно.
				
				ЭлементКартыXDTO = Неопределено;
				
			КонецЕсли;
			
			// Обрабатываем подчиненные элементы.
			СвернутьДеревоКарты(МассивКолонок, Строка.Строки, ЭлементКартыXDTO, ПредметКарты, УровеньДетализации, СкрыватьРесурсСОднимФайлом, ОбрабатываемаяПодборка, ОбрабатываемыйРесурс);
			
			
		КонецЕсли;
		
	    Сч = Сч - 1;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура СформироватьXDTOЭлементовКарты(ПредметКартыСсылка, ЭлементыКартыXDTO, ПредметКарты, УровеньДетализации, СкрыватьРесурсСОднимФайлом)
	
	// Секция ВЫБОР
	
	ТекстЗапроса = "ВЫБРАТЬ
	|";
	
	Если ПредметКарты = "KnowledgeBase" ИЛИ ПредметКарты = "Folder" Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|	СодержаниеСУЗ.Ссылка КАК ЭлементСводаЗнаний,
		|	СодержаниеСУЗ.ПометкаУдаления КАК ПометкаУдаленияЭлементаСводаЗнаний,
		|	СодержаниеСУЗ.Владелец КАК СводЗнаний,
		|	СодержаниеСУЗ.ЭтоГруппа КАК ЭтоГруппаСводаЗнаний,
		|	СодержаниеСУЗ.Наименование КАК НаименованиеЭлементаСводаЗнаний,
		|	СодержаниеСУЗ.СсылкаНаЭлемент КАК ОбъектСУЗЭлементаСводаЗнаний,
		|	СодержаниеСУЗ.Код КАК КодЭлементаСводаЗнаний,
		|	СодержаниеСУЗ.Карта КАК КартаЭлементаСводаЗнаний";
		
				
	КонецЕсли;
	
	Если ПредметКарты = "Collection" ИЛИ УровеньДетализации = "level2" Тогда

		Если УровеньДетализации = "level2" Тогда
			
			ТекстЗапроса = ТекстЗапроса + ",
			|   ФайлыСУЗСводаЗнаний.Владелец КАК РесурсСводаЗнаний,
			|	ФайлыСУЗСводаЗнаний.Владелец.Наименование КАК НаименованиеРесурсаСводаЗнаний,
			|	ФайлыСУЗСводаЗнаний.Владелец.ФайлЗапуска КАК ФайлЗапускаРесурсаСводаЗнаний,
			|	ФайлыСУЗСводаЗнаний.Ссылка КАК ФайлСводаЗнаний,
			|	ФайлыСУЗСводаЗнаний.ЭтоГруппа КАК ЭтоГруппаФайловСводаЗнаний,
			|	ФайлыСУЗСводаЗнаний.ПометкаУдаления КАК ПометкаУдаленияФайлаСводаЗнаний,
			|	ФайлыСУЗСводаЗнаний.Наименование КАК НаименованиеФайлаСводаЗнаний,
			|	ФайлыСУЗСводаЗнаний.Скрывать КАК СкрыватьФайлСводаЗнаний,
			|";
			
		КонецЕсли;
		
			ТекстЗапроса = ТекстЗапроса + "
			|	ЭлементыПодборкиСУЗ.Владелец КАК Подборка,
			|	ЭлементыПодборкиСУЗ.Владелец.Наименование КАК НаименованиеПодборки,
			|	ЭлементыПодборкиСУЗ.Ссылка КАК ЭлементыПодборки,
			|	ЭлементыПодборкиСУЗ.ПометкаУдаления КАК ПометкаУдаленияЭлементаПодборки,
			|	ЭлементыПодборкиСУЗ.ЭтоГруппа КАК ЭтоГруппаПодборки,
			|	ЭлементыПодборкиСУЗ.Наименование КАК НаименованиеЭлементаПодборки,
			|	ЭлементыПодборкиСУЗ.СсылкаНаОбъектСУЗ КАК ОбъектСУЗЭлементаПодборки,
			|	ЭлементыПодборкиСУЗ.Код КАК КодЭлементаПодборки,
			|	ЭлементыПодборкиСУЗ.Владелец.Карта КАК КартаПодборки,
			|	ЭлементыПодборкиСУЗ.Владелец.ЭтоТест КАК ЭтоТест,
			
			|	ФайлыСУЗПодборок.Владелец КАК РесурсыПодборок,
			|	ФайлыСУЗПодборок.Владелец.Наименование КАК НаименованиеРесурсаПодборок,
			|	ФайлыСУЗПодборок.Владелец.ФайлЗапуска КАК ФайлЗапускаРесурсаПодборок,
			|	ФайлыСУЗПодборок.Ссылка КАК ФайлПодборок,
			|	ФайлыСУЗПодборок.ЭтоГруппа КАК ЭтоГруппаФайловПодборок,
			|	ФайлыСУЗПодборок.ПометкаУдаления КАК ПометкаУдаленияФайлаПодборки,
			|	ФайлыСУЗПодборок.Наименование КАК НаименованиеФайлаПодборок,
			|	ФайлыСУЗПодборок.Скрывать КАК СкрыватьФайлПодборки
			|";
			
	КонецЕсли;
	
	
	// Секция ИЗ
	
	Если ПредметКарты = "KnowledgeBase" ИЛИ ПредметКарты = "Folder" Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|ИЗ
		|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
		|";
		
		Если УровеньДетализации = "level2" Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФайлыСУЗ КАК ФайлыСУЗСводаЗнаний
			|			ПО СодержаниеСУЗ.СсылкаНаЭлемент = ФайлыСУЗСводаЗнаний.Владелец
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФайлыСУЗ КАК ФайлыСУЗПодборок
			|			ПО ЭлементыПодборкиСУЗ.СсылкаНаОбъектСУЗ = ФайлыСУЗПодборок.Владелец
			|		ПО СодержаниеСУЗ.СсылкаНаЭлемент = ЭлементыПодборкиСУЗ.Владелец
			|";
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПредметКарты = "Collection" Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|ИЗ
		|	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФайлыСУЗ КАК ФайлыСУЗПодборок
		|		ПО ЭлементыПодборкиСУЗ.СсылкаНаОбъектСУЗ = ФайлыСУЗПодборок.Владелец
		|";
		
	КонецЕсли;
	
	
	// Секция ГДЕ
	
	ТекстЗапроса = ТекстЗапроса + "
	|ГДЕ
	|";
	
	Если ПредметКарты = "KnowledgeBase" ИЛИ ПредметКарты = "Folder" Тогда
	
		Если ПредметКарты = "KnowledgeBase" Тогда
			ТекстЗапроса = ТекстЗапроса + "СодержаниеСУЗ.Владелец = &ПредметКарты" + Символы.ПС;
		Иначе
			ТекстЗапроса = ТекстЗапроса + "СодержаниеСУЗ.Ссылка В ИЕРАРХИИ(&ПредметКарты)" + Символы.ПС;
		КонецЕсли;

	КонецЕсли;
	
	Если ПредметКарты = "Collection" Тогда
		
		ТекстЗапроса = ТекстЗапроса + "ЭлементыПодборкиСУЗ.Владелец = &ПредметКарты" + Символы.ПС;
		
	КонецЕсли;
	
	// Секция УПОРЯДОЧИТЬ ПО
	
	ТекстЗапроса = ТекстЗапроса + "УПОРЯДОЧИТЬ ПО
	|";
	
	Если ПредметКарты = "KnowledgeBase" ИЛИ ПредметКарты = "Folder" Тогда

		ТекстЗапроса = ТекстЗапроса + "ЭлементСводаЗнаний ИЕРАРХИЯ
		|";
		
		Если УровеньДетализации = "level2" Тогда
			
			ТекстЗапроса = ТекстЗапроса + ",
			|	РесурсСводаЗнаний,
			|	ФайлСводаЗнаний ИЕРАРХИЯ,
			|	Подборка,
			|	ЭлементыПодборки ИЕРАРХИЯ,
			|	РесурсыПодборок,
			|	ФайлПодборок ИЕРАРХИЯ
			|";	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПредметКарты = "Collection" Тогда
		
		ТекстЗапроса = ТекстЗапроса + "ЭлементыПодборки ИЕРАРХИЯ,
		|	РесурсыПодборок,
		|	ФайлПодборок ИЕРАРХИЯ
		|";
		
	КонецЕсли;
	
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПредметКарты", ПредметКартыСсылка);
	
	ДеревоКарты = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	МассивКолонок = Новый Массив(); // Эти колонки используются для формирования XDTO.
	
	ДеревоКарты.Колонки.Добавить("Наименование");
	МассивКолонок.Добавить("Наименование");
	
	ДеревоКарты.Колонки.Добавить("Код");
	МассивКолонок.Добавить("Код");
	
	ДеревоКарты.Колонки.Добавить("ЭтоГруппа");
	МассивКолонок.Добавить("ЭтоГруппа");
	
	ДеревоКарты.Колонки.Добавить("СсылкаНаОбъектСУЗ");
	МассивКолонок.Добавить("СсылкаНаОбъектСУЗ");
	
	ДеревоКарты.Колонки.Добавить("ТипОбъектаСУЗ");
	МассивКолонок.Добавить("ТипОбъектаСУЗ");
	
	ДеревоКарты.Колонки.Добавить("СсылкаНаВладельца");
	МассивКолонок.Добавить("СсылкаНаВладельца");
	
	ДеревоКарты.Колонки.Добавить("ТипОбъектаСУЗВладельца");
	МассивКолонок.Добавить("ТипОбъектаСУЗВладельца");
	
	ДеревоКарты.Колонки.Добавить("Карта");
	МассивКолонок.Добавить("Карта");
	
	ДеревоКарты.Колонки.Добавить("Ссылка");
	МассивКолонок.Добавить("Ссылка");
	
	ДеревоКарты.Колонки.Добавить("ПометкаУдаления");
	МассивКолонок.Добавить("ПометкаУдаления");
	
	ДеревоКарты.Колонки.Добавить("Скрывать");
	МассивКолонок.Добавить("Скрывать");
	
	
	СвернутьДеревоКарты(МассивКолонок, ДеревоКарты.Строки, ЭлементыКартыXDTO, ПредметКарты, УровеньДетализации, СкрыватьРесурсСОднимФайлом);
	
КонецПроцедуры

#КонецЕсли
